// Дано натуральное число n. Выведите все числа от 1 до n.

// let n=5;
// for(let i=1;i<=n;i++){
//     console.log(i);
// }

// - Даны два целых числа A и В . Выведите все числа от A до B включительно, в порядке возрастания, если A < B,
// или в порядке убывания в противном случае.

// let a=27;
// let b=18;
//
// if(a<b) {
//     for (let i = a; i <= b; i++) {
//         console.log(i);
//     }
// }
//     else{
//         for (let i=a;i>=b;i--){
//             console.log(i)
//         }
//     }


// -   функція Приймає масив та число "i", та міняє місцями об`єкт який знаходиться в індексі "i" на "i+1"
//   EXAMPLE:
//   foo([9,8,0,4], 0) // ==> [ 8, 9, 0, 4 ]
//   foo([9,8,0,4], 1) // ==> [ 9 ,0, 8, 4 ]
//   foo([9,8,0,4], 2) // ==> [ 9, 8, 4, 0 ]

// const foo=(array,count)=>{
//     for(let i=0;i<array.length;i++) {
//         if (i === count) {
//             let tmp = array[i];
//             array[i] = array[i + 1];
//             array[i + 1] = tmp;
//         }
//     }
//     console.log(array)
// }
// foo([15,75,41,30],0);

// - Сворити функцію яка буде переносити елементи з значенням 0 у кінець маисву. Зберігаючи при цьому порядок не нульових значень.
// Двожина масиву від 2 до 100
// EXAMPLE:
// [1,0,6,0,3] => [1,6,3,0,0]
// [0,1,2,3,4] => [1,2,3,4,0]
// [0,0,1,0]   => [1,0,0,0]


// const func=(array)=>{
//     const newArray=[];
// for(let i=array.length-1;i>=0;i--){
//     if(array[i]===0){
//       newArray.push(array[i]);
//     }
//     else {
//         newArray.unshift(array[i]);
//     }
// }
// console.log(newArray);
// }
// func([15,85,0,96,0,3]);


